/* 객체란 실제 세계에 있는 물체들을 프로그램으로 표현한 것을 객체라고 한다.
 * 
 * 절차 지향 프로그래밍은 데이터와 알고리즘이 묶여있지 않고
 * 
 * 객체 지향 프로그래밍은 데이터와 알고리즘이 묶여있다(=객체)
 *                             (객체는 필드와 메소드로 이루어져 있다.)
 * 
 * 객체지향프로그래밍의 특징 1.캡슐화 2.상속 3.다형성
 * 
 * 캡슐화는 데이터와 알고리즘을 캡슐에 넣어서 포장한다는 것을 의미
 *                    (=클래스) 
 * 또한 내부데이터를 보호하는 역할도 함.
 * 
 * 상속은 기존의 부모클래스의 코드를 자식클래스가 상속받아서 더 필요한게 있다면 기능을 추가 또는 변경할수있다.
 *                              (=>기존의 코드를 이어 받는다.)             (=>기존에 있던것을 덮어서 변경하는것을 오버라이딩이라 한다.)
 *                              
 * 다형성은 여러가지 형태를 가질수 있는 능력을 의미한다.
 * =>부모클래스 타입의 참조변수로 자식클래스의 인스턴스를 참조할수 있도록하는것
 * 
 * 상향 형변환 - 자바에서 수퍼 클래스 객체가 있는 곳을 서브 클래스 객체로 대치하는것이 가능
 * 
 * 하향 형변화 - 상향형변환과는 반대로 서브 클래스 참조변수로 수퍼 클래스 객체를 참조하는 것
 * 
 * 
 * 
 */
